In [ ]:
import pandas as pd

In [ ]:
data = pd.read_csv("../python-ml-course-master/datasets/customer-churn-model/Customer Churn Model.txt")

In [ ]:
data.head()

###Crear un subconjunto de datos

In [ ]:
account_length = data["Account Length"]
account_length.head()

In [ ]:
subset = data[["Account Length","Phone","Eve Charge","Day Calls"]]
subset.head()

In [ ]:
desired_columns = ["Account Length","Phone","Eve Charge","Night Calls"]
subset = data[desired_columns]
subset.head()

In [ ]:
desired_columns = ["Account Length","VMail Message","Day Calls"]
desired_columns

In [61]:
all_columns_list = data.columns.values.tolist()
all_columns_list

['State',
 'Account Length',
 'Area Code',
 'Phone',
 "Int'l Plan",
 'VMail Plan',
 'VMail Message',
 'Day Mins',
 'Day Calls',
 'Day Charge',
 'Eve Mins',
 'Eve Calls',
 'Eve Charge',
 'Night Mins',
 'Night Calls',
 'Night Charge',
 'Intl Mins',
 'Intl Calls',
 'Intl Charge',
 'CustServ Calls',
 'Churn?']

In [ ]:
sublist = [x for x in all_columns_list if x not in desired_columns]
sublist

In [ ]:
subset = data[sublist]
subset.head()

In [ ]:
a = set(desired_columns)
b = set(all_columns_list)
sublist = b-a
sublist = list(sublist)

sublist

In [ ]:
data[:1]

In [ ]:
##### Usuarios con Total Mins > 300

data1 = data[data["Day Mins"]>300]

data1.shape

In [ ]:
###NEW YORK
data2 = data[data["State"]=="NY"]

data2.shape

In [ ]:
#### AND
data3 = data[(data["State"]=="NY") & (data["Day Mins"]>300)]

data3.shape

In [ ]:
data4 = data[((data["State"]=="NY") | (data["Day Mins"]>300)) & (data["Day Charge"]>26)]

data4.shape

In [51]:
data5 = data[(data["Day Charge"] < data["Day Mins"]) ]

data5.shape

(3331, 21)

In [53]:
##Minutos de dia, de noche y long de los primeros 50 individuos
subset_first_50 = data[["Day Mins", 'Night Mins', 'Account Length']][:50]
subset_first_50.head()

   Day Mins  Night Mins  Account Length
0     265.1       244.7             128
1     161.6       254.4             107
2     243.4       162.6             137
3     299.4       196.9              84
4     166.7       186.9              75

In [57]:
data.iloc[1:10, 3:6] ## Primeras 10 filas, columnas de la 3 a la 6

      Phone Int'l Plan VMail Plan
1  371-7191         no        yes
2  358-1921         no         no
3  375-9999        yes         no
4  330-6626        yes         no
5  391-8027        yes         no
6  355-9993         no        yes
7  329-9001        yes         no
8  335-4719         no         no
9  330-8173        yes        yes

In [58]:
data.iloc[1:10, [2,5,7]]

   Area Code VMail Plan  Day Mins
1        415        yes     161.6
2        415         no     243.4
3        408         no     299.4
4        415         no     166.7
5        510         no     223.4
6        510        yes     218.2
7        415         no     157.0
8        408         no     184.5
9        415        yes     258.6

In [59]:
data.iloc[[1,5,8,36], [2,5,7]]

    Area Code VMail Plan  Day Mins
1         415        yes     161.6
5         510         no     223.4
8         408         no     184.5
36        408        yes     146.3

In [66]:
data.loc[[1,5,8,36], ["Area Code", "VMail Plan", "Day Mins"]]

    Area Code VMail Plan  Day Mins
1         415        yes     161.6
5         510         no     223.4
8         408         no     184.5
36        408        yes     146.3

In [69]:
data["Total Mins"] = data["Day Mins"] + data["Night Mins"] + data["Eve Mins"]

data["Total Mins"].head()

0    707.2
1    611.5
2    527.2
3    558.2
4    501.9
Name: Total Mins, dtype: float64

In [70]:
data["Total Calls"] = data["Day Calls"] + data["Night Calls"] + data["Eve Calls"]

data["Total Calls"].head()

0    300
1    329
2    328
3    248
4    356
Name: Total Calls, dtype: int64